{
 "cells": [
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Напишите программу, которая запрашивает у пользователя количество строк для вывода. В каждой строке должна быть последовательность чисел от 1 до текущего номера строки, где:\n",
    "Четные числа должны быть умножены на 2.\n",
    "Нечетные числа должны быть возведены в квадрат.\n",
    "После этого программа должна вывести результат в консоль с помощью функции print(). Для вычисления результата необходимо использовать именованные функции и вложенные циклы.\n",
    "\n",
    "Формат ввода\n",
    "\n",
    "7\n",
    "\n",
    "Формат вывода\n",
    "\n",
    "1\n",
    "\n",
    "1 4\n",
    "\n",
    "1 4 9\n",
    "\n",
    "1 4 9 8\n",
    "\n",
    "1 4 9 8 25\n",
    "\n",
    "1 4 9 8 25 12\n",
    "\n",
    "1 4 9 8 25 12 49\n",
    "\n",
    "Примечания\n",
    "Обязательно наличие в решении хотя бы одной именованной функции, объявленной через def и хотя бы одного вложенного цикла. Вывод результата сделать с помощью функции print()."
   ],
   "id": "f54133b14403184d"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def calculate_number(n):\n",
    "    \"\"\"Вычисляет значение числа в соответствии с правилами\"\"\"\n",
    "    if n % 2 == 0:  # Четное число\n",
    "        return n * 2\n",
    "    else:  # Нечетное число\n",
    "        return n * n  # n в квадрате\n",
    "\n",
    "def print_sequence(rows):\n",
    "    \"\"\"Выводит последовательности чисел для заданного количества строк\"\"\"\n",
    "    for i in range(1, rows + 1):\n",
    "        for j in range(1, i + 1):\n",
    "            result = calculate_number(j)\n",
    "            print(result, end=' ')\n",
    "        print()  # Переход на новую строку\n",
    "\n",
    "def main(rows=None):\n",
    "    \"\"\"Основная функция программы\n",
    "\n",
    "    Args:\n",
    "        rows: количество строк (если None, запрашивается у пользователя)\n",
    "    \"\"\"\n",
    "    try:\n",
    "        if rows is None:\n",
    "            rows = int(input(\"Введите количество строк для вывода: \"))\n",
    "\n",
    "        if rows <= 0:\n",
    "            print(\"Количество строк должно быть положительным числом.\")\n",
    "            return\n",
    "\n",
    "        print_sequence(rows)\n",
    "\n",
    "    except ValueError:\n",
    "        print(\"Ошибка: введите целое число.\")\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ],
   "id": "605b0b8fe48ae5f7"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Напишите функцию, которая принимает два числа и возвращает большее из них. Используйте именованную функцию для сравнения чисел и именованную функцию высшего порядка для её применения.\n",
    "Формат ввода\n",
    "7\n",
    "3\n",
    ".Формат вывода\n",
    "7\n",
    "Примечания\n",
    "Обязательно наличие в решении хотя бы двух именованных функций, объявленных через def, при этом хотя бы одна из них должна принимать другую функцию в качестве аргумента."
   ],
   "id": "c1a71dc83a829257"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-01T18:05:48.495362Z",
     "start_time": "2025-12-01T18:05:44.548247Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def compare_numbers(a, b):\n",
    "    \"\"\"Сравнивает два числа и возвращает большее\"\"\"\n",
    "    if a > b:\n",
    "        return a\n",
    "    else:\n",
    "        return b\n",
    "\n",
    "def apply_comparison(func, x, y):\n",
    "    \"\"\"Принимает функцию сравнения и два числа, применяет её\"\"\"\n",
    "    return func(x, y)\n",
    "\n",
    "def main():\n",
    "    \"\"\"Основная функция для получения ввода и вывода результата\"\"\"\n",
    "    try:\n",
    "        # Чтение двух чисел\n",
    "        num1 = int(input().strip())\n",
    "        num2 = int(input().strip())\n",
    "\n",
    "        # Применение функции сравнения через функцию высшего порядка\n",
    "        result = apply_comparison(compare_numbers, num1, num2)\n",
    "\n",
    "        # Вывод результата\n",
    "        print(result)\n",
    "\n",
    "    except ValueError:\n",
    "        print(\"Ошибка: введите целые числа.\")\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ],
   "id": "a079350e6e98227f",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5\n"
     ]
    }
   ],
   "execution_count": 20
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Напишите функцию, которая принимает число N и возвращает первое простое число больше N. Используйте анонимную функцию для проверки, является ли число простым, и функцию высшего порядка для его нахождения.\n",
    "\n",
    "Формат ввода\n",
    "5\n",
    "\n",
    "Формат вывода\n",
    "7\n",
    "\n",
    "Примечания\n",
    "Обязательно наличие в решении хотя бы одной именованной функции, объявленной через def и хотя бы одной анонимной функции, объявленной через lambda."
   ],
   "id": "973f301e7cf92cce"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-01T18:05:54.274045Z",
     "start_time": "2025-12-01T18:05:54.254103Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def next_prime(N):\n",
    "    # Анонимная функция для проверки, является ли число простым\n",
    "    is_prime = lambda n: n > 1 and all(n % i != 0 for i in range(2, int(n**0.5) + 1))\n",
    "\n",
    "    # Функция высшего порядка для нахождения первого простого числа больше N\n",
    "    def find_next_prime(start, condition):\n",
    "        current = start + 1\n",
    "        while True:\n",
    "            if condition(current):\n",
    "                return current\n",
    "            current += 1\n",
    "\n",
    "    return find_next_prime(N, is_prime)"
   ],
   "id": "754e49361cb64fc0",
   "outputs": [],
   "execution_count": 21
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Напишите функцию, которая принимает длины двух катетов прямоугольного треугольника и возвращает длину гипотенузы. Используйте вложенную анонимную функцию для вычисления.\n",
    "\n",
    "Формат ввода\n",
    "3\n",
    "\n",
    "4\n",
    "\n",
    "Формат вывода\n",
    "5\n",
    "\n",
    "Примечания\n",
    "Обязательно наличие в решении хотя бы одной именованной функции, объявленной через def и хотя бы одной анонимной функции, объявленной через lambda."
   ],
   "id": "3189983c3f5fd3db"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-01T18:05:56.738878Z",
     "start_time": "2025-12-01T18:05:56.728570Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def calculate_hypotenuse(a, b):\n",
    "    \"\"\"Принимает длины двух катетов и возвращает длину гипотенузы\"\"\"\n",
    "    # Непосредственно возвращаем результат вызова анонимной функции\n",
    "    return (lambda x, y: (x**2 + y**2)**0.5)(a, b)"
   ],
   "id": "959b0f37689b7b52",
   "outputs": [],
   "execution_count": 22
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
